NMMI/SoftHandPRO-and-Generic-FW-PSoC5/SoftHand_Pro.cydsn/Generated_Source/PSoC5/project.h
/*******************************************************************************
* File Name: project.h
* 
* PSoC Creator  4.4
*
* Description:
* It contains references to all generated header files and should not be modified.
* This file is automatically generated by PSoC Creator.
*
********************************************************************************
* Copyright (c) 2007-2020 Cypress Semiconductor.  All rights reserved.
* You may use this file only in accordance with the license, terms, conditions, 
* disclaimers, and limitations in the end user license agreement accompanying 
* the software package with which this file was provided.
********************************************************************************/

#include "cyfitter_cfg.h"
#include "cydevice.h"
#include "cydevice_trm.h"
#include "cyfitter.h"
#include "cydisabledsheets.h"
#include "CURRENT_SENSE_2_aliases.h"
#include "CURRENT_SENSE_2.h"
#include "VOLTAGE_SENSE_2_aliases.h"
#include "VOLTAGE_SENSE_2.h"
#include "EMG_6_aliases.h"
#include "EMG_6.h"
#include "EMG_5_aliases.h"
#include "EMG_5.h"
#include "EMG_4_aliases.h"
#include "EMG_4.h"
#include "EMG_3_aliases.h"
#include "EMG_3.h"
#include "EMG_2_aliases.h"
#include "EMG_2.h"
#include "EMG_1_aliases.h"
#include "EMG_1.h"
#include "VOLTAGE_SENSE_1_aliases.h"
#include "VOLTAGE_SENSE_1.h"
#include "CURRENT_SENSE_1_aliases.h"
#include "CURRENT_SENSE_1.h"
#include "EMG_A_aliases.h"
#include "EMG_A.h"
#include "EMG_B_aliases.h"
#include "EMG_B.h"
#include "MOSI_aliases.h"
#include "MOSI.h"
#include "SCLK_aliases.h"
#include "SCLK.h"
#include "Chip_Select_IMU.h"
#include "MOTOR_DIR_1.h"
#include "MOTOR_1B_aliases.h"
#include "MOTOR_1B.h"
#include "EEPROM.h"
#include "FTDI_ENABLE_aliases.h"
#include "FTDI_ENABLE.h"
#include "RS485_CTS_aliases.h"
#include "RS485_CTS.h"
#include "CLOCK_PWM.h"
#include "PWM_MOTORS.h"
#include "CS3_aliases.h"
#include "CS3.h"
#include "MOTOR_1A_aliases.h"
#include "MOTOR_1A.h"
#include "PACER_TIMER.h"
#include "RESET_FF.h"
#include "FF_STATUS.h"
#include "MY_TIMER.h"
#include "timer_clock.h"
#include "UART_RS485.h"
#include "RS_485_EN_aliases.h"
#include "RS_485_EN.h"
#include "ISR_RS485_RX.h"
#include "CLOCK_UART.h"
#include "CYCLES_TIMER.h"
#include "counter_cyc_clk.h"
#include "ISR_CYCLES.h"
#include "Bootloadable.h"
#include "SD.h"
#include "CS_on_board_IMU_aliases.h"
#include "CS_on_board_IMU.h"
#include "MISO_aliases.h"
#include "MISO.h"
#include "CS_RTC_aliases.h"
#include "CS_RTC.h"
#include "CLK_RTC_aliases.h"
#include "CLK_RTC.h"
#include "MOSI_RTC_aliases.h"
#include "MOSI_RTC.h"
#include "MISO_RTC_aliases.h"
#include "MISO_RTC.h"
#include "SPI_IMU.h"
#include "SPI_IMU_PVT.h"
#include "CS1_aliases.h"
#include "CS1.h"
#include "MOTOR_DIR_2.h"
#include "CS0_aliases.h"
#include "CS0.h"
#include "LED_RED_aliases.h"
#include "LED_RED.h"
#include "BLINK_05HZ.h"
#include "LED_CTRL.h"
#include "BLINK_CTRL_EN.h"
#include "LED_GREEN_aliases.h"
#include "LED_GREEN.h"
#include "BLINK_25HZ.h"
#include "ADC_SOC.h"
#include "DMA_dma.h"
#include "ADC_STATUS.h"
#include "ADC.h"
#include "CLOCK_PWM_BLINK.h"
#include "CS2_aliases.h"
#include "CS2.h"
#include "MOTOR_2A_aliases.h"
#include "MOTOR_2A.h"
#include "MOTOR_2B_aliases.h"
#include "MOTOR_2B.h"
#include "MOTOR_EN_1_aliases.h"
#include "MOTOR_EN_1.h"
#include "MOTOR_ON_OFF_1.h"
#include "MOTOR_EN_2_aliases.h"
#include "MOTOR_EN_2.h"
#include "ADC_N_CHANNELS_USED.h"
#include "CS_ENCODER1_aliases.h"
#include "CS_ENCODER1.h"
#include "COUNTER_ENC.h"
#include "CLOCK_ENCODERS.h"
#include "SHIFTREG_ENC_3.h"
#include "SHIFTREG_ENC_2.h"
#include "CLK_ENCODER_aliases.h"
#include "CLK_ENCODER.h"
#include "MISO_ENCODER_aliases.h"
#include "MISO_ENCODER.h"
#include "CS_ENCODER0_aliases.h"
#include "CS_ENCODER0.h"
#include "SHIFTREG_ENC_1.h"
#include "RESET_COUNTERS.h"
#include "Chip_Select_ENCODER_LINE.h"
#include "MY_TIMER_REG.h"
#include "MOTOR_DRIVER_TYPE.h"
#include "MOTOR_ON_OFF_2.h"
#include "SD_SPI0.h"
#include "SD_SPI0_PVT.h"
#include "SD_mosi0_aliases.h"
#include "SD_mosi0.h"
#include "SD_Clock_1.h"
#include "SD_miso0_aliases.h"
#include "SD_miso0.h"
#include "SD_sclk0_aliases.h"
#include "SD_sclk0.h"
#include "SD_SPI0_CS_aliases.h"
#include "SD_SPI0_CS.h"
#include "ADC_AMux.h"
#include "ADC_Ext_CP_Clk.h"
#include "ADC_IRQ.h"
#include "ADC_theACLK.h"
#include "core_cm3_psoc5.h"
#include "CyDmac.h"
#include "CyFlash.h"
#include "CyLib.h"
#include "cypins.h"
#include "cyPm.h"
#include "CySpc.h"
#include "cytypes.h"
#include "cy_em_eeprom.h"

/*[]*/

